benchmarks/localhost/all_on/get_case.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/cases/UPHC020665842025
Document Length:        1833 bytes

Concurrency Level:      1
Time taken for tests:   0.563 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      219700 bytes
HTML transferred:       183300 bytes
Requests per second:    177.71 [#/sec] (mean)
Time per request:       5.627 [ms] (mean)
Time per request:       5.627 [ms] (mean, across all concurrent requests)
Transfer rate:          381.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     4    6   1.3      5      15
Waiting:        4    5   1.3      5      15
Total:          4    6   1.3      5      15

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      6
  80%      6
  90%      6
  95%      7
  98%     10
  99%     15
 100%     15 (longest request)


| Metric          |                  Value |
| --------------- | ---------------------: |
| Endpoint        | `GET /api/cases/{cnr}` |
| Environment     |              Localhost |
| Configuration   |             **All ON** |
| Redis           |                     ON |
| Kafka           |                     ON |
| Circuit Breaker |                     ON |
| Outbox          |                     ON |
| Requests        |                    100 |
| Concurrency     |                      1 |
| Mean latency    |           **5.627 ms** |
| Median (P50)    |               **5 ms** |
| P90             |               **6 ms** |
| P95             |               **7 ms** |
| P99             |              **15 ms** |
| Max             |              **15 ms** |
| Throughput      |       **177.71 req/s** |
| Errors          |                  **0** |