benchmarks/localhost/all_on/get_cases.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/cases
Document Length:        10305 bytes

Concurrency Level:      1
Time taken for tests:   1.050 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      1066900 bytes
HTML transferred:       1030500 bytes
Requests per second:    95.28 [#/sec] (mean)
Time per request:       10.495 [ms] (mean)
Time per request:       10.495 [ms] (mean, across all concurrent requests)
Transfer rate:          992.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     6   10   6.3      9      58
Waiting:        6   10   6.2      8      58
Total:          6   10   6.3      9      58

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     12
  80%     13
  90%     14
  95%     20
  98%     32
  99%     58
 100%     58 (longest request)


| Metric          |            Value |
| --------------- | ---------------: |
| Endpoint        | `GET /api/cases` |
| Environment     |        Localhost |
| Configuration   |       **All ON** |
| Redis           |               ON |
| Kafka           |               ON |
| Circuit Breaker |               ON |
| Outbox          |               ON |
| Requests        |              100 |
| Concurrency     |                1 |
| Mean latency    |    **10.495 ms** |
| Median (P50)    |         **9 ms** |
| P90             |        **14 ms** |
| P95             |        **20 ms** |
| P99             |        **58 ms** |
| Max             |        **58 ms** |
| Throughput      |  **95.28 req/s** |
| Errors          |            **0** |
| Response Size   | **10,305 bytes** |