benchmarks/localhost/all_on/refresh.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/auth/refresh
Document Length:        511 bytes

Concurrency Level:      1
Time taken for tests:   0.697 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      87500 bytes
Total body sent:        37200
HTML transferred:       51100 bytes
Requests per second:    143.44 [#/sec] (mean)
Time per request:       6.972 [ms] (mean)
Time per request:       6.972 [ms] (mean, across all concurrent requests)
Transfer rate:          122.57 [Kbytes/sec] received
                        52.11 kb/s sent
                        174.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3    7  20.5      5     209
Waiting:        3    7  20.4      4     208
Total:          3    7  20.5      5     209

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      6
  90%      6
  95%      7
  98%     11
  99%    209
 100%    209 (longest request)


| Metric          |                      Value |
| --------------- | -------------------------: |
| Endpoint        |   `POST /api/auth/refresh` |
| Environment     |                  Localhost |
| Configuration   |                 **All ON** |
| Redis           |                         ON |
| Kafka           |                         ON |
| Circuit Breaker |                         ON |
| Outbox          |                         ON |
| Requests        |                        100 |
| Concurrency     |                          1 |
| Mean latency    |               **6.972 ms** |
| Median (P50)    |                   **5 ms** |
| P90             |                   **6 ms** |
| P95             |                   **7 ms** |
| P99             | **209 ms** *(one outlier)* |
| Max             |                 **209 ms** |
| Throughput      |           **143.44 req/s** |
| Errors          |                      **0** |